#ifndef _GAUSSIAN_H
#define _GAUSSIAN_H

#ifdef k9x9

// 预先计算的9x9高斯模糊滤波器（σ约为1.75）
const float weight[5] = float[] (
    0.2270270270,  // 偏移0
    0.1945945946,  // 偏移+1 -1
    0.1216216216,  // 偏移+2 -2
    0.0540540541,  // 偏移+3 -3
    0.0162162162   // 偏移+4 -4
);

#endif

#ifdef k11x11

// 预先计算的11x11高斯模糊滤波器（σ = 4）
const float weight[6] = float[] (
    0.1198770,  // 偏移0
    0.1161890,  // 偏移+1 -1
    0.1057910,  // 偏移+2 -2
    0.0904881,  // 偏移+3 -3
    0.0727092,  // 偏移+4 -4
    0.0548838   // 偏移+5 -5
);

#endif

#ifdef k13x13

// 预先计算的13x13高斯模糊滤波器（σ = 4）
const float weight[7] = float[] (
    0.1112200,  // 偏移0
    0.1077980,  // 偏移+1 -1
    0.0981515,  // 偏移+2 -2
    0.0839534,  // 偏移+3 -3
    0.0674585,  // 偏移+4 -4
    0.0509203,  // 偏移+5 -5
    0.0361079   // 偏移+6 -6
);

#endif

#ifdef k15x15

// 预先计算的15x15高斯模糊滤波器（σ = 4）
const float weight[8] = float[] (
    0.1061150,  // 偏移0
    0.1028510,  // 偏移+1 -1
    0.0936465,  // 偏移+2 -2
    0.0801001,  // 偏移+3 -3
    0.0643623,  // 偏移+4 -4
    0.0485832,  // 偏移+5 -5
    0.0344506,  // 偏移+6 -6
    0.0229491   // 偏移+7 -7
);

#endif

#ifdef k19x19

// 预先计算的19x19高斯模糊滤波器（σ = 5）
const float weight[10] = float[] (
    0.0846129,  // 偏移0
    0.0829375,  // 偏移+1 -1
    0.0781076,  // 偏移+2 -2
    0.0706746,  // 偏移+3 -3
    0.0614416,  // 偏移+4 -4
    0.0513203,  // 偏移+5 -5
    0.0411855,  // 偏移+6 -6
    0.0317562,  // 偏移+7 -7
    0.0235255,  // 偏移+8 -8
    0.0167448   // 偏移+9 -9
);

#endif

#endif
